OpenFOAM_6/tutorials/heatTransfer/chtMultiRegionFoam/reverseBurner/constant/gas/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    energySource
    {
        type            scalarSemiImplicitSource;

        timeStart       0.2;
        duration        0.3;
        selectionMode   cellSet;
        cellSet         ignition;
        volumeMode      specific;

        injectionRateSuSp
        {
            h          (2e7 0); // kg/m/s^3
        }
    }
}


// ************************************************************************* //
